### pivot_table
1. 그룹화
2. 행 인덱스
3. 열 인덱스
4. 데이터 값
5. 데이터의 집계

In [2]:
import pandas as pd
import seaborn as sns

In [3]:
titanic = sns.load_dataset('titanic')\
    [['age', 'sex', 'class', 'fare', 'survived']]
titanic.head(1)

    age   sex  class  fare  survived
0  22.0  male  Third  7.25         0

In [10]:
pd.pivot_table(
    titanic, ## 기준이 되는 데이터프레임
    index = 'class', ## 등급별로 그룹화
    columns = 'sex', ## 성별로 분할
    values = 'age', ## 그룹화된 데이터들의 나이를 선택
    aggfunc = 'mean' ## 나이의 평균
)

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

### 클래스별 성별 생존자의 수를 출력
1. groupby
2. pivot_table

In [17]:
## case1. groupby
group_data = titanic.groupby(['class', 'sex']).sum()[['survived']]

In [18]:
group_data

               survived
class  sex
First  female        91
       male          45
Second female        70
       male          17
Third  female        72
       male          47

In [20]:
## case2. pivot_table
pd.pivot_table(
    titanic, 
    index = 'class',
    columns = 'sex',
    values = 'survived',
    aggfunc = 'sum'
)

sex     female  male
class
First       91    45
Second      70    17
Third       72    47

In [21]:
## columns 생략 가능
pd.pivot_table(
    titanic, 
    index = ['class', 'sex'],
    values = 'survived',
    aggfunc = 'sum'
)

               survived
class  sex
First  female        91
       male          45
Second female        70
       male          17
Third  female        72
       male          47

In [23]:
## 자리등급과 성별에 따라 
## 생존자와 사망자의 
## 나이의 평균

pd.pivot_table(
    titanic,
    index = ['class', 'sex'],
    columns = 'survived',
    values = 'age',
    aggfunc = 'mean'
)

survived               0          1
class  sex
First  female  25.666667  34.939024
       male    44.581967  36.248000
Second female  36.000000  28.080882
       male    33.369048  16.022000
Third  female  23.818182  19.329787
       male    27.255814  22.274211